{"sample_weight_mode": null, "class_name": "Sequential", "loss": "mse", "keras_version": "1.0.6", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 1, 2048], "name": "flatten_1", "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"activation": "relu", "b_constraint": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "output_dim": 256, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0010000000474974513, "l2": 0.0}, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "linear", "b_constraint": null, "name": "dense_2", "b_regularizer": null, "trainable": true, "output_dim": 36, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}}], "optimizer": {"momentum": 0.8999999761581421, "name": "SGD", "nesterov": false, "lr": 9.99999993922529e-09, "decay": 0.0}}