{"optimizer": {"nesterov": false, "momentum": 0.8999999761581421, "lr": 9.999999974752427e-07, "name": "SGD", "decay": 0.0}, "config": [{"config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 1, 2048], "input_dtype": "float32"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0010000000474974513, "name": "WeightRegularizer", "l2": 0.0}, "name": "dense_1", "b_regularizer": null, "output_dim": 768}, "class_name": "Dense"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "output_dim": 256}, "class_name": "Dense"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_4", "b_regularizer": null, "output_dim": 36}, "class_name": "Dense"}], "keras_version": "1.0.6", "loss": "mse", "sample_weight_mode": null, "class_name": "Sequential"}